pyel.org
* documentation
TODO: how to export a heading as pdf or into a seporate file?

TODO: update most of this. tranforms have changed
** type switches
 pyel-switch forms are inserted in a backquoted form so an ',' unquote
 may be used. DO NOT UNQUOTE THE ARGUMENTS, they will be replaced later

** from py ast to e-lisp transform
#+Begin_SRC emacs-lisp 
  ;;First, get the python ast:
  (py-ast "(a,b)")
  "Module(body=[Expr(value=Tuple(elts=[Name(id='a', ctx=Load()), Name(id='b', ctx=Load())], ctx=Load()))])
  "
  
  ;;Second create any newly needed python AST interpretor.
  ;; Here we need Tuple(elts,ctx)
  
  def Tuple(elts, ctx):
      return l_str(["tuple ", ll_str(elts), ctx])
  
  ;;Third, define a tranform to convert the function to lisp
  (def-transform tuple pyel ()
    (lambda (elts ctx) ;;Ignoring ctx for now
      (concat "["
              (mapconcat 'transform elts " ")
              "]")))
  
  
  ;;Forth, create tests. Evaluate the expresstion, the test are sent to the kill ring
  (pyel-create-tests 'Tuple
                     "()"
                     "(a, b)"
                     "(a, (b, (c,d)))"
                     "((((((((a))))))))")
#+END_SRC  
** ways to define new transforms
TODO:
 how to define a macro transform

*** change a function name
Example:
#+Begin_SRC emacs-lisp 
(pyel-translate-function-name 'range 'py-range)
(pyel-translate-function-name 'map 'mapcar)o
#+END_SRC 
*** change a variable name
Example:
#+Begin_SRC emacs-lisp 
(pyel-translate-variable-name 'None 'nil)
#+END_SRC 
*** define a general translation
Example:
#+Begin_SRC emacs-lisp 
(def-transform assert pyel ()
    (lambda (test msg) 
      `(assert ,(transform test) t ,(transform msg))))
#+END_SRC 

*** define a method translation
$var replaces var with name of the original var
   (expands to ,var in the macro definition) 
 other parameter references are evaluated and assigned to tmp variables
#+Begin_SRC emacs-lisp 
(pyel-method-transform append (obj thing)
                  (list _) -> (setq $obj (append obj (list thing)))
                  (_ _)    -> (append obj thing))
#+END_SRC 

*** define a function translation
#+Begin_SRC emacs-lisp 
  (pyel-func-transform len (thing)
                       (object) -> (__len__ ,thing)
                       (_)      -> (length ,thing))
#+END_SRC 
*** type switching transforms
  (pyel-create-py-func ** (l r) ;;pow
                    (number number) -> (expt l r)
                    (object _ ) 
                    (_ object) -> (--pow-- l r))

*** declare a name to be a macro
(pyel-declare-macro "save_excursion")
** writing faster code
*** large difference
*** small difference
prevent pyel from converting *varargs to a vector. Instead manipulate it in python as if it were a list instead of a tuple like it normally is.
put the following line in your config:
  (setq pyel-use-list-for-varargs t)
  ==> NO! ALL CHANGES TO CODE TRANSFORMS SHOULD BE INDECATED IN THE PYTHON SOURCE

* headers
** main
#+Begin_SRC emacs-lisp :tangle pyel.el
  ;; This is a tangled file  -- DO NOT EDIT --  Edit in pyel.org
#+END_SRC
** transforms
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  ;; This is a tangled file  -- DO NOT EDIT --  Edit in pyel.org
#+END_SRC
** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  ;; This is a tangled file  -- DO NOT EDIT --  Edit in pyel.org
#+END_SRC
** py-lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  ;; This is a tangled file  -- DO NOT EDIT --  Edit in pyel.org
#+END_SRC
** python ast
#+Begin_SRC python :tangle py-ast.py
  # This is a tangled file  -- DO NOT EDIT --  Edit in pyel.org
#+END_SRC  

* main
header
** require 
#+Begin_SRC emacs-lisp :tangle pyel.el
  (add-to-list 'load-path "~/programming/pyel/")
  (add-to-list 'load-path "~/programming/code-transformer/")  
  (require 'eieio)
  (require 'cl) 
;;other requires are at the end
#+END_SRC

** main
 #+Begin_SRC emacs-lisp :tangle pyel.el
;; This is a tangled file  -- DO NOT HAND-EDIT -- 
;;PYEL -> translate PYthon to Emacs Lisp
#+END_SRC  

main
#+Begin_SRC emacs-lisp :tangle pyel.el
  (defun mpp (code)
    (let ((pp (pp-to-string code)))
      (insert "\n" pp)))
  
  
  ;;TODO: more robust checking, return type of error as well
  (defun pyel-is-error (code)
    "return the line of the error in CODE, else nil"
    (let ((line))
      (if (string-match "^Traceback" code)
          (with-temp-buffer
            (insert code)
            (goto-char (point-max))
            (if (re-search-backward "line \\([0-9]+\\)")
                (setq line (match-string 1)))))
      ;;TODO: why is this the actual line number...it should be relative the a bunch of code it's appended to ...
      (and line (string-to-number line))))
  
  (defvar pyel-transform-status nil
    "indicate status (success/fail) of last pyel transform
  status types:
  nil for no error
  ('python ast transform error'  <line number>) 
  ")
  
  (defvar pyel-error-string "PYEL ERROR"
    "string returned by `pyel' when it failed to transform")
  
  (defun pyel-py-ast-file-name ()
    "return the full file name of py-ast.el"
    (file-path-concat pyel-directory "py-ast.py"))
  
  
  (defun pyel (python &optional py-ast-only include-defuns)
    "translate PYTHON into Emacs Lisp.
  PYTHON is a string.
  If PY-AST-ONLY, return the un-evaled ast.
  If INCLUDE-DEFUNS, include the list of pyel defined functions in the output
    this is ignored if PY-AST-ONLY is non-nil"
    (assert (eq lexical-binding nil) "pyel requires dynamic scoping")
    
    (setq pyel-marked-ast-pieces nil)
    (setq pyel-transform-status nil) ;;so far so good...
  
    (let* (;;Q general way of replacing backslashes?
           (python (replace-regexp-in-string "\"" "\\\\\"" python))
           ;(python (replace-regexp-in-string "\n" "\\\\n" python nil :literal))
           
           ;; (pyel "x = 'x\n'")
          (py-ast "")
          (el-code "")
          (current-transform-table (get-transform-table 'pyel))
          (python (with-temp-buffer
                    (insert python)
                    (pyel-preprocess-buffer2)
                    (buffer-string)))
          (pyel-context nil)
          line ret
          )
      
      ;;?? setting the mark?
      (with-temp-buffer
        ;;    (find-file file)
        ;;    (erase-buffer)
        (insert-file-contents-literally (pyel-py-ast-file-name))
        (goto-char (point-max))
        (insert "\n")
        (setq line (line-number-at-pos))
        (insert (format "print(eval(ast.dump(ast.parse(\"\"\"%s\"\"\"))))" python))
        (write-region
         nil
         nil
         pyel-tmp-file nil 'silent))
      
      (setq py-ast (shell-command-to-string (format "python3 %s" pyel-tmp-file)))
  
      (if (setq py-error (pyel-is-error py-ast))
          (progn
            (setq pyel-python-error-line py-error)
            pyel-error-string)
          ;;else: no error
      (if py-ast-only
          py-ast
        ;;      (pyel-do-splices (transform (read py-ast))))))
        ;;read can only return one sexp so we need to put it in a progn or something
        ;;similar
        
        (setq ret (pyel-do-splices (if include-defuns
                             (list '@ (cons '@ pyel-function-definitions)
                                      (transform (read (format "(@ %s)" py-ast))))
                           (transform (read  (format "(@ %s)" py-ast))))))
        ;;TODO: this is a temp solution for convenience
        (mapc 'eval pyel-function-definitions) 
        ret
        ))))
  
  
  (defun pyel-buffer-to-string (&optional ast-only)
    "transform python in current buffer and return a string"
    ;;THIS DOES NOT RETURN A STRING!
    (pyel (buffer-string) ast-only))
  
  
  (defvar pyel-pp-function 'pp-to-string
        "function that pretty prints pyel e-lisp code")
        
  (defun pyel-buffer (&optional out-buff)
    "transform python in current buffer and display in OUT-BUFF,
  OUT-BUFF defaults to *pyel-output*"
    (interactive)
    (let ((out (pyel-buffer-to-string)))
      (switch-to-buffer-other-window "*pyel-output*")
      (erase-buffer)
      (insert (funcall 'pyel-pp-function out))
      (emacs-lisp-mode)))
  
  (defun pyel-transform-ast (ast &optional no-splice)
    "transform a python AST to Emacs Lisp, AST must be a string
  AST can be generated by `pyel' with (pyel py-string t)"
    (with-transform-table 'pyel
                          (let ((code (transform (read  (format "(@ %s)" ast)))))
                            (if no-splice
                                code
                              (pyel-do-splices code)))))
  
  
  (defun pyel-file-ast (file-name)
    "return the ast from .py file FILE-NAME"
    )
        
  (defmacro pyel-with-known-types (known-types &rest code)
    "translate CODE while faking the known types"
    `(flet ((pyel-get-possible-types
             (&rest args)
             (mapcar* (lambda (arg type) (cons arg type))
                      args ,known-types)))
       
       (pyel ,@code)))
  
  
  (defun py-ast (code &optional pp)
    "Return the python abstract syntax tree for python CODE"
    (let ((py-ast "")
          (el-code "")
          ret)
      
      (with-temp-buffer
        (insert "import ast" "\n")
        (insert (format "print(ast.dump(ast.parse(\"\"\"%s\"\"\")))" code))
        (write-region nil nil pyel-tmp-file nil 'silent))
      
      (setq ret (shell-command-to-string (format "python3 %s" pyel-tmp-file)))
      (if pp
          (mapconcat 'identity (split-string ret ",") ",\n")
        ret)))
  
  
  ;;'(a (@ b (c)))) => (a b (c))
  ;;'(a (@ b c)))   => (a b c)
  ;;'(@ a b c) => (progn a b c)
  ;;'(@ (a b)) = > (a b)
  ;;'(a (@) b) = > (a b)
  
  (defun pyel-do-splices (code)
    (if (listp code)
        (let (c)
          (if (eq (car code) '@) ;;special case: outer most list 
              (if (> (length code) 2)
                  (pyel-do-splices `(progn ,code))
                (pyel-do-splices (cadr code)))
            (let ((ncode nil))
              (while code
                (setq c (pop code))
                (if (listp c)
                    (if (equal (car c) '@)
                        (setq ncode (append (reverse (pyel-do-splices (cdr c))) ncode))
                      (push (pyel-do-splices c) ncode))
                  (push c ncode)))
              (if (listp ncode) (reverse ncode) ncode))))
      code))
  
  
  
  (defun pyel-reload ()
      (interactive)
      (dolist (f '(pyel
                   pyel-tests
                   pyel-transforms
                   pyel-mode
                   pyel-pp
                   pyel-preprocessor
                   transformer))
        (setq features (remove f features)))
      (require 'pyel))
  
  
  (defun pyel-method-transform-name(method-name)
    "return the name of the temlate that transform the method METHOD-NAME.
  template names are modified to avoid potential conflict with other templates"
    (intern (format "_%s-method_" (symbol-name method-name))))
  
  
  (defun pyel-func-transform-name (func-name)
    "like `pyel-method-transform-name' for functions"
    (intern (format "_%s-function_" (symbol-name func-name))))
  
  
  
  (defmacro push-back (val place)
    "Add VAL to the end of the sequence stored in PLACE. Return the new
  value."
    `(setq ,place (append ,place (list ,val))))
  
  (defun pyel-translate-function-name (name new-name)
    "translate python NAME to e-lisp NEW-NAME"
    (push (list name new-name) pyel-function-name-translations))
  
  (defun pyel-translate-variable-name (name new-name)
    "translate python  NAME to e-lisp NEW-NAME"
    (push (list name new-name) pyel-variable-name-translations))
  
  
  (defun pyel-not-implemented (message)
    "signify that a feature is not implemented"
    ;;TODO
    (message message) ;;tmp
    )
  
  
  (defmacro insert-at (list nth value)
    "insert VALUE at NTH index in LIST"
    `(setq ,list (append (subseq ,list 0 ,nth)
                         (list ,value)
                         (subseq ,list  ,nth))))
  
  (defun list-to-vector (list)
    (eval `(vector ,@list))) ;;this is gross
  
  
  (defun _to- (thing)
    (cond
     ((stringp thing)
  
      (replace-regexp-in-string "_" "-"  thing))
     ((symbolp thing)
      (intern (replace-regexp-in-string "_" "-"  (symbol-name thing))))
     ((listp thing) (mapcar '_to- thing))
     (t (error "ERROR in _to-. invalid thing"))))
  
  
  (defun pyel-change-ctx (form ctx)
    "change ctx of form to CTX"
    (let ((type (and (listp form) (car form))))
      (cond ((eq type 'name)
             (list (car form) (cadr form) (list 'quote ctx)))
            ;;TODO: attribute and other forms (if needed)
            (t form))))
  
  
  (defun pyel-make-ast (type &rest args)
    "Generate pyhon ast.
  This is used when the ast form is needed by a transform that is manually
   called from another transform"
    (flet ((assert_n_args (type expect have)
                          (assert (= expect have)
                                  (format "pyel-make-ast -- ast type '%s'expects %s args. received %s args" type expect have)))
           (correct_ctx (ctx)
                        (if (symbolp ctx)
                            (pyel-make-ast ctx)
                          ctx))
           (correct_to_string (name)
                              (if (stringp name)
                                  name
                                (if (symbolp name)
                                    (symbol-name name)
                                  (error "invalid type for 'name'")))))
      
      ;;TODO: should have seporate functions to check
      ;;      the validity of the ast instead of having
      ;;      the correction functions do it
      (case type
        
        (subscript ;;args: value slice ctx
         (assert_n_args 'subscript 3 (length args))
         
         (let ((ctx (correct_ctx (car (last args)))))
           (list 'subscript (car args) (cadr args) ctx)))
        
        (name ;;args: name ctx
         (assert_n_args 'name 2 (length args))
         (let* ((name (correct_to_string (car args)))
                
                (ctx (correct_ctx (car (last args)))))
           
           (list 'name name ctx)))
        
        (load
         '(quote load))
        (store
         '(quote store)))))
#+END_SRC


