pyel.org
*** tests
(pyel-create-tests 'len
"a = [1,2,3,'5']
assert len(a) == 4"
"a = []
assert len(a) == 0"
"a = 'str'
assert len(a) == 3"
"a = (1,2)
assert len(a) == 2"
"assert len('')==0"
)

#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (ert-deftest pyel-len-full-transform nil
    (should
     (equal
      (pyel "a = [1,2,3,'5']\nassert len(a) == 4")
      '(progn
         (pyel-set a
                   (list 1 2 3 "5"))
         (assert
          (pyel-==
           (pyel-len-function a)
           4)
          t nil))))
    (should
     (equal
      (pyel "a = []\nassert len(a) == 0")
      '(progn
         (pyel-set a
                   (list))
         (assert
          (pyel-==
           (pyel-len-function a)
           0)
          t nil))))
    (should
     (equal
      (pyel "a = 'str'\nassert len(a) == 3")
      '(progn
         (pyel-set a "str")
         (assert
          (pyel-==
           (pyel-len-function a)
           3)
          t nil))))
    (should
     (equal
      (pyel "a = (1,2)\nassert len(a) == 2")
      '(progn
         (pyel-set a
                   (vector 1 2))
         (assert
          (pyel-==
           (pyel-len-function a)
           2)
          t nil))))
    (should
     (equal
      (pyel "assert len('')==0")
      '(assert
        (pyel-==
         (pyel-len-function "")
         0)
        t nil))))
  (ert-deftest pyel-len-py-ast nil
    (should
     (equal
      (py-ast "a = [1,2,3,'5']\nassert len(a) == 4")
      "Module(body=[Assign(targets=[Name(id='a', ctx=Store())], value=List(elts=[Num(n=1), Num(n=2), Num(n=3), Str(s='5')], ctx=Load())), Assert(test=Compare(left=Call(func=Name(id='len', ctx=Load()), args=[Name(id='a', ctx=Load())], keywords=[], starargs=None, kwargs=None), ops=[Eq()], comparators=[Num(n=4)]), msg=None)])\n"))
    (should
     (equal
      (py-ast "a = []\nassert len(a) == 0")
      "Module(body=[Assign(targets=[Name(id='a', ctx=Store())], value=List(elts=[], ctx=Load())), Assert(test=Compare(left=Call(func=Name(id='len', ctx=Load()), args=[Name(id='a', ctx=Load())], keywords=[], starargs=None, kwargs=None), ops=[Eq()], comparators=[Num(n=0)]), msg=None)])\n"))
    (should
     (equal
      (py-ast "a = 'str'\nassert len(a) == 3")
      "Module(body=[Assign(targets=[Name(id='a', ctx=Store())], value=Str(s='str')), Assert(test=Compare(left=Call(func=Name(id='len', ctx=Load()), args=[Name(id='a', ctx=Load())], keywords=[], starargs=None, kwargs=None), ops=[Eq()], comparators=[Num(n=3)]), msg=None)])\n"))
    (should
     (equal
      (py-ast "a = (1,2)\nassert len(a) == 2")
      "Module(body=[Assign(targets=[Name(id='a', ctx=Store())], value=Tuple(elts=[Num(n=1), Num(n=2)], ctx=Load())), Assert(test=Compare(left=Call(func=Name(id='len', ctx=Load()), args=[Name(id='a', ctx=Load())], keywords=[], starargs=None, kwargs=None), ops=[Eq()], comparators=[Num(n=2)]), msg=None)])\n"))
    (should
     (equal
      (py-ast "assert len('')==0")
      "Module(body=[Assert(test=Compare(left=Call(func=Name(id='len', ctx=Load()), args=[Str(s='')], keywords=[], starargs=None, kwargs=None), ops=[Eq()], comparators=[Num(n=0)]), msg=None)])\n")))
  (ert-deftest pyel-len-el-ast nil
    (should
     (string=
      (pyel "a = [1,2,3,'5']\nassert len(a) == 4" t)
      "(assign  ((name  \"a\" 'store)) (list ((num 1) (num 2) (num 3) (str \"5\")) 'load))\n(assert  (compare  (call  (name  \"len\" 'load) ((name  \"a\" 'load)) nil nil nil) (\"==\") ((num 4))) nil)\n"))
    (should
     (string=
      (pyel "a = []\nassert len(a) == 0" t)
      "(assign  ((name  \"a\" 'store)) (list nil 'load))\n(assert  (compare  (call  (name  \"len\" 'load) ((name  \"a\" 'load)) nil nil nil) (\"==\") ((num 0))) nil)\n"))
    (should
     (string=
      (pyel "a = 'str'\nassert len(a) == 3" t)
      "(assign  ((name  \"a\" 'store)) (str \"str\"))\n(assert  (compare  (call  (name  \"len\" 'load) ((name  \"a\" 'load)) nil nil nil) (\"==\") ((num 3))) nil)\n"))
    (should
     (string=
      (pyel "a = (1,2)\nassert len(a) == 2" t)
      "(assign  ((name  \"a\" 'store)) (tuple  ((num 1) (num 2)) 'load))\n(assert  (compare  (call  (name  \"len\" 'load) ((name  \"a\" 'load)) nil nil nil) (\"==\") ((num 2))) nil)\n"))
    (should
     (string=
      (pyel "assert len('')==0" t)
      "(assert  (compare  (call  (name  \"len\" 'load) ((str \"\")) nil nil nil) (\"==\") ((num 0))) nil)\n")))
  
#+END_SRC

** range
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (push '(range py-range) pyel-function-name-translations)
#+END_SRC
*** python el lib
#+Begin_SRC python :tangle py-lib.el
(defun py-range (start &optional end step)
  (unless end
    (setq end start
	  start 0))
  (number-sequence start (1- end) step))
#+END_SRC

*** tests
(pyel-create-tests '<name>
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

** input
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-translate-function-name 'input 'read-string)
#+END_SRC

** list
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-translate-function-name 'list 'py-list)
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-list (&rest things)
    "tries to be like python's list function"
    (if (> (length things) 1)
        things
      (setq thing (car things))
      (cond
       ((stringp thing)
        (split-string thing "" :omit-nulls))
       ((vectorp thing)
        (mapcar 'identity thing))
       ((hash-table-p thing)
        (let (keys)
          (maphash (lambda (key value)
                     (setq keys (cons key keys))) thing)
          keys))
       ((listp thing) (copy-list thing)))))
  
#+END_SRC

*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (ert-deftest pyel-py-list nil
    (should (equal (py-list "string")
                    '("s" "t" "r" "i" "n" "g")))
    (should (equal (py-list [2 3 4 4])
                   '(2 3 4 4)))
    (should (equal  (py-list '(2 3 4 4))
                    '(2 3 4 4)))
    (should (equal (py-list 23 4 2 "h")
                   '(23 4 2 "h")))
    (should (equal (py-list (let ((__h__ (make-hash-table :test (quote equal)))) (puthash 1 "1" __h__) (puthash "3" 3 __h__) (puthash 23 2 __h__) __h__))
                   '(23 "3" 1))))
  ;;(pyel "{1:'1','3':3,23:2}")  
#+END_SRC

** simple name changes
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-translate-function-name 'map 'mapcar)
(pyel-translate-function-name 'chr 'byte-to-string)
#+END_SRC
*** tests
(pyel-create-tests '<name>
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

** transform template
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
;;
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py

#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC

*** tests
(pyel-create-tests '<name>
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

* built-in method transforms
TODO: tests!
** append
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-method-transform extend(obj thing)
                  (list _) -> (setq $obj (append obj thing))
                  (_ _)    -> (append obj thing))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py

#+END_SRC
*** python el lib
#+Begin_SRC python :tangle py-lib.el

#+END_SRC

*** tests
(pyel-create-tests '<name>
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

** insert
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-method-transform insert (obj i x)
		       (list _) -> (let () (setq $obj (append (subseq obj 0 i)
							      (list x)
							      (subseq obj i))))
		       (object _) -> (insert obj i x))
#+END_SRC
*** python el lib
#+Begin_SRC python :tangle py-lib.el

#+END_SRC

*** tests
(pyel-create-tests '<name>
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

** index
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform index (obj elem)
                    (list _) -> (list-index elem obj)
                    (string _) -> (string-match elem obj);;TODO: this uses regex, python does not
                    (vector _) -> (vector-index elem obj)
  
                    (object _)    -> (__index__ obj thing)) ;;?
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun list-index (elem list)
    "return the index of ELEM in LIST"
    (let ((m (member elem list)))
      (when m
        (- (length list) (length m)))))
  
  
  
  (defun vector-index (elem vector)
   "return the index of ELEM in VECTOR"
   (let ((i 0)
         (len (length vector))
         found)
  
      (while (and (< i len)
              (not found))
       (if (equal (aref vector i) elem)
        (setq found i)
        (setq i (1+ i))))
    found))
#+END_SRC

*** tests
(pyel-create-tests '<name>
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

** remove
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-method-transform remove (obj x)
		       (list _) ->  (let ((i (list-index x obj)))
				      (if i
					  (setq $obj (append (subseq obj 0 i)
							     (subseq obj (1+ i))))
					(error "ValueError: list.remove(x): x not in list")))
		       (object _) -> (remove obj x))
#+END_SRC
*** python el lib
#+Begin_SRC python :tangle py-lib.el

#+END_SRC

*** tests
(pyel-create-tests '<name>
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

** count
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform count (obj elem)
                    (string _) -> (count-str-matches obj elem)
                    (list _) -> (count-elems-list obj elem)
                    (vector _) -> (count-elems-vector obj elem)
                    (object _)  -> (count thing));;
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun count-str-matches (string substr)
    "count number of occurrences of SUBSTR in STRING"
    (with-temp-buffer
      (insert string)
      (goto-char 1)
      (how-many substr)))
  
  (defun count-elems-list (list elem)
    "return how many times ELEM occurs in LIST"
    (let ((c 0))
      (dolist (x list)
        (if (equal x elem)
            (setq c (1+ c))))
      c))
  
  (defun count-elems-vector (vector elem)
    "return how many times ELEM occurs in VECTOR"
    (let ((c 0)
          (i 0)
          (len (length vector)))
      (while (< i len)
        (if (equal (aref vector i) elem)
            (setq c (1+ c)))
        (setq i (1+ i)))
      c))
#+END_SRC

*** tests
(pyel-create-tests '<name>
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

** transform template
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
;;
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py

#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC

*** tests
(pyel-create-tests '<name>
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

** join
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform join (obj elem)
                    (string _) ->  (mapconcat 'identity elem obj) 
                    (_ _)      -> (join obj thing))
#+END_SRC
*** tests
(pyel-create-tests '<name>
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC


* macro transforms
macros and macroish primitives
** cond
*** tests
(pyel-create-tests 'cond
"x = cond([1 > 2, 'first']
   [2 == 2, 'second']
   [5 == 7, 'third']
   [True, error('wtf')])
assert x == 'second'"
)
NOTE: had to change __pyel_marker_2__ to __pyel_marker_1__ in generated test
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (ert-deftest pyel-cond-full-transform nil
    (should
     (equal
      (pyel "x = cond([1 > 2, 'first']\n   [2 == 2, 'second']\n   [5 == 7, 'third']\n   [True, error('wtf')])\nassert x == 'second'")
      '(progn
         (pyel-set x
                   (cond
                    ((pyel-> 1 2)
                     "first")
                    ((pyel-== 2 2)
                     "second")
                    ((pyel-== 5 7)
                     "third")
                    (t
                     (error "wtf"))))
         (assert
          (pyel-== x "second")
          t nil)))))
  (ert-deftest pyel-cond-py-ast nil
    (should
     (equal
      (py-ast "x = cond([1 > 2, 'first']\n   [2 == 2, 'second']\n   [5 == 7, 'third']\n   [True, error('wtf')])\nassert x == 'second'")
      "Module(body=[Assign(targets=[Name(id='x', ctx=Store())], value=Call(func=Name(id='cond', ctx=Load()), args=[Subscript(value=Subscript(value=Subscript(value=List(elts=[Compare(left=Num(n=1), ops=[Gt()], comparators=[Num(n=2)]), Str(s='first')], ctx=Load()), slice=Index(value=Tuple(elts=[Compare(left=Num(n=2), ops=[Eq()], comparators=[Num(n=2)]), Str(s='second')], ctx=Load())), ctx=Load()), slice=Index(value=Tuple(elts=[Compare(left=Num(n=5), ops=[Eq()], comparators=[Num(n=7)]), Str(s='third')], ctx=Load())), ctx=Load()), slice=Index(value=Tuple(elts=[Name(id='True', ctx=Load()), Call(func=Name(id='error', ctx=Load()), args=[Str(s='wtf')], keywords=[], starargs=None, kwargs=None)], ctx=Load())), ctx=Load())], keywords=[], starargs=None, kwargs=None)), Assert(test=Compare(left=Name(id='x', ctx=Load()), ops=[Eq()], comparators=[Str(s='second')]), msg=None)])\n")))
  (ert-deftest pyel-cond-el-ast nil
    (should
     (string=
      (pyel "x = cond([1 > 2, 'first']\n   [2 == 2, 'second']\n   [5 == 7, 'third']\n   [True, error('wtf')])\nassert x == 'second'" t)
      "(assign  ((name  \"x\" 'store)) (name  \"test_marker\" 'load))\n(assert  (compare  (name  \"x\" 'load) (\"==\") ((str \"second\"))) nil)\n")))
  
#+END_SRC
** lambda
