pyel.org
** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform unary-op pyel ()
    (lambda (op operand)
      (call-transform op operand)))
  
  (pyel-create-py-func not (x)
                       (object) -> (--not-- x) ;;?
                       (_) -> (not x))
  
  (pyel-create-py-func usub (x)
                       (number) -> (- x)
                       (object) -> (--usub-- x) ;;?
                       )
#+END_SRC
** python ast
#+Begin_SRC python :tangle py-ast.py

#+END_SRC
** python el lib
#+Begin_SRC python :tangle py-lib.el

#+END_SRC

** tests
(pyel-create-tests '<name>
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

* in, not in
TODO: tests!
** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  ;;a not in b
  ;; function:    is_not(a, b)  (in the operator module)
  (pyel-create-py-func not-in (l r)
                       (_ list) -> (not (member l r))
                       (_ vector) -> (not (vector-member l r))
                       (_ object) -> (--not-in-- r l) ;;?
                       )
  
  
  ;;a in b
  ;; function:    is_(a, b)
  (pyel-create-py-func in (l r)
                       (_ list) -> (member l r)
                       (_ vector) -> (vector-member l r)
                       (_ object) -> (--in-- r l);;?
                       )
#+END_SRC
** python el lib
#+Begin_SRC python :tangle py-lib.el
  (defun vector-member (elt vector)
   "Return non-nil if ELT is an element of VECTOR.  Comparison done with `equal'."
   (let ((i 0)
         (len (length vector))
         found)
    (while (and (not found)
            (< i len))
     (if (equal (elt vector i) elt)
      (setq found t)
      (setq i (1+ i))))
    found))
#+END_SRC

** tests
(pyel-create-tests '<name>
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

* comprehensions
DOC: generator expressions are translated to list comprehensions

** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform comprehension pyel (target iter ifs)
    (lambda (target iter ifs) (pyel-comprehension target iter ifs)))
  
  
  
  (defun pyel-comprehension (target iter ifs)
    ;;this uses the inter-transform var 'comprehension-body'
    (assert (boundp 'comprehension-body)
            "`comprehension-body' must be defined for this transform")
    ;;TODO: ifs
    `(loop for ,(using-context for-loop-target
                               (transform target))
           in (py-list ,(transform iter))
           ,(if ifs
                (list '@ 'if 
                         (cons (if (> (length ifs) 1)
                                   'and
                                 '@)
                               (mapcar 'transform ifs)))
              pyel-nothing) 
           do ,comprehension-body))
  
  
  (def-transform list-comp pyel (elt generators)
    (lambda (elt generators) (pyel-list-comp elt generators)))
  
  (defun pyel-list-comp (elt generators)
    (let* ((list-var '__list__)
           (comprehension-body `(setq ,list-var (cons ,(transform elt) ,list-var)))
           (i (length generators))
           code)
      ;;`comprehension-body' is an inter-transform var
      (while (> i 0)
        (setq i (1- i))
        ;;'comprehension-body' holds the inner code, and each transform
        ;; is the inner code for the preceding generator in 'generators'
        ;; (loop ... collect ...) produces a list, so no additional work is needed
        (setq comprehension-body (transform (nth i generators))))
      
      `(let ((,list-var nil))
         ,comprehension-body
         (reverse ,list-var))))
  
  
  (def-transform dict-comp pyel (key value generators)
    (lambda (key value generators) (pyel-dict-comp key value generators)))
  
  (defun pyel-dict-comp (key value generators)
    (let* ((hash-var '__dict__)
           (comprehension-body (list 'puthash (transform key)
                                     (transform value)
                                     hash-var))
           (i (length generators))
           code)
      (while (> i 0)
        (setq i (1- i))
        (setq comprehension-body (transform (nth i generators))))
      
      `(let ((,hash-var (make-hash-table :test 'equal)))
         ,comprehension-body
         ,hash-var)))
#+END_SRC
** python ast
#+Begin_SRC python :tangle py-ast.py
  def comprehension(target, iter, ifs):
      return l_str(["comprehension", target, iter, l_str(ifs)])
  
  def GeneratorExp(elt, generators):
      return l_str(["list-comp", elt, l_str(generators)])
      
  def ListComp(elt, generators):
      return l_str(["list-comp", elt, l_str(generators)])
  
  def DictComp(key, value, generators):
      return l_str(["dict-comp", key, value, l_str(generators)])    
  
  def SetComp(elt, generators):
      return "(unimplemented \"set comprehension\")"
  
  
#+END_SRC
** python el lib
#+Begin_SRC python :tangle py-lib.el

#+END_SRC

