py-lib.el



















(defun vector-member (elt vector)
 "Return non-nil if ELT is an element of VECTOR.  Comparison done with `equal'."
 (let ((i 0)
       (len (length vector))
       found)
  (while (and (not found)
          (< i len))
   (if (equal (elt vector i) elt)
    (setq found t)
    (setq i (1+ i))))
  found))









